// This file can be replaced during build by using the `fileReplacements` array.
// `ng build` replaces `environment.ts` with `environment.prod.ts`.
// The list of file replacements can be found in `angular.json`.

export const environment = {
  production: false,
  servicesURL: '',
  servicesMock: {
    counts: [
      {
        id: 'care',
        display: 'רווחה',
        count: 4
      },
      {
        id: 'housing',
        display: 'דיור',
        count: 2
      },
      {
        id: 'food',
        display: 'מזון',
        count: 1
      },
    ],
    services: [
      {
        service_name: 'מרכז שיקום גראבסקי',
        address: 'הניצנים 7, מגדל העמק',
        description: 'מסגרת דיור טיפולית-שיקומית בקהילה המיועדת לתת מענה מותאם לאנשים עם מוגבלות בכל תחומי החיים.ישנם הוסטלים עבור ילדים/בוגרים בתפקודים ברמות שונות, המקדמים השתלבות בקהילה עד כמה שניתן.',
        urls: [
          {
            link: 'https://www.guidestar.org.il/organization/580324408',
            title: 'הארגון בגיידסטאר'  
          }
        ],
        responses: [
          {
            id: 'human_services:care:residential_care',
            category: 'care',
            name: 'מסגרות טיפוליות'
          }
        ]
      },
      {
        service_name: 'מעון הבית בחולון',
        address: 'רחל 12, חולון, ישראל',
        phone_number: '03-5553434',
        description: 'מסגרת דיור טיפולית-שיקומית בקהילה המיועדת לתת מענה מותאם לאנשים עם מוגבלות בכל תחומי החיים.ישנם הוסטלים עבור ילדים/בוגרים בתפקודים ברמות שונות, המקדמים השתלבות בקהילה עד כמה שניתן.',
        details: 'מסגרת דיור המאפשרת לאנשים עם מוגבלות להשתלב בקהילה בכל תחומי החיים (תעסוקה, בריאות, פנאי, חברה, תרבות, שימוש במשאבי קהילה). מסגרת דיור טיפולית-שיקומית בקהילה המיועדת לתת מענה מותאם לאנשים עם מוגבלות בכל תחומי החיים.זמני הפעילות: המסגרות פועלות 365 ימים בשנה.מספר הדיירים במסגרת: המסגרת מיועדת לעד 24 דיירים, ופועלת בדרך כלל  במספר יחידות דיור.השירותים במסגרת כולליםשירותים פיזיים: טיפול פיזי, היגיינה אישית, כלכלה, תנאים פיזיים - מבנה, שירותי אחזקה, תשתיות וציוד. שירותים ומשאבי קהילה בתחומים: תעסוקה, פנאי, רפואה ועוד. תוכנית אישית: לכל דייר נבנית ומופעלת תוכנית אישית שמטרתה לסייע בשיפור מיומנויות תפקודיות שונות ולפתח עצמאות מרבית ככל הניתן.מסגרת דיור בתוך הקהילה, המסגרת מתוקצבת עבור 16 שעות ביממה והדייר זכאי לתקצוב נוסף לתחום התעסוקה. הדיור מיועד אנשים עם מוגבלות ברמות תפקוד שונות שמסוגלים להשתלב במסגרות דיור בקהילה, וזקוקים לרוב לליווי ותמיכה ברמה בינונית. המסגרות מהוות בתים לחיים - משך השהות במסגרת אינו מוגבל ואדם עם מוגבלות יכול להישאר במסגרת זו כל עוד היא תואמת את צרכיו ורצונותיו.',
        urls: [],
        responses: [
          {
            id: 'human_services:care:residential_care',
            category: 'care',
            name: 'מסגרות טיפוליות'
          }
        ],
        payment: true,
      },
      {
        service_name: 'יעדים לצפון מיסודה של קרן רש"י',
        address: 'דרור 1, כרמיאל',
        phone_number: '03-5553434',
        details: 'מסגרת דיור המאפשרת לאנשים עם מוגבלות להשתלב בקהילה בכל תחומי החיים (תעסוקה, בריאות, פנאי, חברה, תרבות, שימוש במשאבי קהילה). מסגרת דיור טיפולית-שיקומית בקהילה המיועדת לתת מענה מותאם לאנשים עם מוגבלות בכל תחומי החיים.זמני הפעילות: המסגרות פועלות 365 ימים בשנה.מספר הדיירים במסגרת: המסגרת מיועדת לעד 24 דיירים, ופועלת בדרך כלל  במספר יחידות דיור.השירותים במסגרת כולליםשירותים פיזיים: טיפול פיזי, היגיינה אישית, כלכלה, תנאים פיזיים - מבנה, שירותי אחזקה, תשתיות וציוד. שירותים ומשאבי קהילה בתחומים: תעסוקה, פנאי, רפואה ועוד. תוכנית אישית: לכל דייר נבנית ומופעלת תוכנית אישית שמטרתה לסייע בשיפור מיומנויות תפקודיות שונות ולפתח עצמאות מרבית ככל הניתן.מסגרת דיור בתוך הקהילה, המסגרת מתוקצבת עבור 16 שעות ביממה והדייר זכאי לתקצוב נוסף לתחום התעסוקה. הדיור מיועד אנשים עם מוגבלות ברמות תפקוד שונות שמסוגלים להשתלב במסגרות דיור בקהילה, וזקוקים לרוב לליווי ותמיכה ברמה בינונית. המסגרות מהוות בתים לחיים - משך השהות במסגרת אינו מוגבל ואדם עם מוגבלות יכול להישאר במסגרת זו כל עוד היא תואמת את צרכיו ורצונותיו.',
        branch_name: 'סניף כרמיאל',
        urls: [
          {
            link: 'http://www.yeadim.org',
            title: 'אתר הבית'  
          },
          {
            link: 'https://www.guidestar.org.il/organization/580421626',
            title: 'הארגון בגיידסטאר'  
          }
        ],
        responses: [
          {
            id: 'human_services:care:residential_care',
            category: 'care',
            name: 'מסגרות טיפוליות'
          }
        ],
        payment: false,
      },
    ],
  }
};

/*
 * For easier debugging in development mode, you can import the following file
 * to ignore zone related error stack frames such as `zone.run`, `zoneDelegate.invokeTask`.
 *
 * This import should be commented out in production mode because it will have a negative impact
 * on performance if an error is thrown.
 */
// import 'zone.js/plugins/zone-error';  // Included with Angular CLI.
